instabugtask/app/controllers/applications_controller.rb

  def create
    application=Application.new(name: params[:name])
    # application.regenerate_token
    # CreateApplicationWorker.perform_async(application)
    application.save
---
INSERT INTO `applications` (`token`, `name`, `created_at`, `updated_at`) VALUES ('BNb1knC5LGfim8kBbyGhJfeN', 'app1', '2022-07-13 13:53:16', '2022-07-13 13:53:16')

  def show
    application = Application.where("token = :token",{token: params[:app_token]})[0]
---
SELECT `applications`.* FROM `applications` WHERE (token = 'BNb1knC5LGfim8kBbyGhJfeN')