instabugtask/app/controllers/chats_controller.rb

  def show
    application=Application.where("token = :token",{token: params[:app_token]})[0]
    chats=Chat.where("applications_id = :applications_id",{applications_id: application.id})
---
SELECT `applications`.* FROM `applications` WHERE (token = 'sZ8mCY6Uy7hp3Qy97AwjkqNg')
SELECT `chats`.* FROM `chats` WHERE (applications_id = 3)