instabugtask/app/controllers/messages_controller.rb

SELECT `applications`.* FROM `applications` WHERE (token = 'sZ8mCY6Uy7hp3Qy97AwjkqNg')
SELECT `chats`.* FROM `chats` WHERE (applications_id = 3 and number = '1')
SELECT `messages`.* FROM `messages` WHERE (chats_id = 1)
---
  def show
    application=Application.where("token = :token",{token: params[:app_token]})[0]
    chat=Chat.where("applications_id = :applications_id and number = :chat_no",{applications_id: application.id,chat_no: params[:chat_no]})[0]
    messages=Message.where("chats_id = :chats_id",{chats_id: chat.id})