instabugtask/app/controllers/search_controller.rb

SELECT `applications`.* FROM `applications` WHERE (token = 'sZ8mCY6Uy7hp3Qy97AwjkqNg')
SELECT `chats`.* FROM `chats` WHERE (applications_id = 3 and number= '1')
---
    def search
        application=Application.where("token = :token",{token: params[:app_token]})[0]
        chat=Chat.where("applications_id = :applications_id and number= :chat_no",{applications_id: application.id,chat_no: params[:chat_no]})[0]